app/controllers/task_temps_controller.rb

  def index
    @tasks = @list.tasks.where("type = ?","TaskTemp").where.not("estado = ?","expirada").order(:prioridad)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND (type = 'TaskTemp') AND (NOT (estado = 'expirada')) ORDER BY "tasks"."prioridad" ASC  [["list_id", 3]]

  def create
    @task = TaskTemp.new(task_temp_params)
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("descripcion", "estado", "prioridad", "porcentaje_avance", "list_id", "type") VALUES (?, ?, ?, ?, ?, ?)  [["descripcion", "snnxnx"], ["estado", "pendiente"], ["prioridad", #<BigDecimal:b243d304,'0.1E1',9(18)>], ["porcentaje_avance", 0], ["list_id", 14], ["type", "TaskTemp"]]

  def update
    respond_to do |format|
      if @task.update(task_temp_params)
---
UPDATE "tasks" SET "fecha_fin_validez" = ?, "fecha_inicio_validez" = ? WHERE "tasks"."id" = ?  [["fecha_fin_validez", Fri, 05 Feb 2016], ["fecha_inicio_validez", Fri, 05 Feb 2016], ["id", 7]]

    def set_list
      @list=List.find_by_url(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."url" = ? LIMIT ?  [["url", "b-b-b-b-"], ["LIMIT", 1]]